Repository: boyzwj/Llamadock
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Model File
zh_hans: 模型文件

source: Model Library
zh_hans: 模型库

source: Model Path
zh_hans: 模型路径

source: Model Settings
zh_hans: 模型设置

source: Model Source
zh_hans: 模型来源

source: Model Startup Parameters
zh_hans: 模型启动参数

source: Model import completed, but its launch profile could not be created: %@
zh_hans: 模型已导入，但无法创建其启动配置：%@

source: Model name, owner/repository, URL, or llama -hf command
zh_hans: 模型名称、所有者/仓库、URL 或 llama -hf 命令

source: Model name, owner/repository, or modelscope.cn URL
zh_hans: 模型名称、所有者/仓库或 modelscope.cn URL

source: Models
zh_hans: 模型

source: Models allowed in memory at the same time. Use 0 for unlimited.
zh_hans: 允许同时驻留内存的模型数；设为 0 表示不限制。

source: More
zh_hans: 更多

source: More Actions
zh_hans: 更多操作

source: Move %@ to Trash
zh_hans: 将 %@ 移到废纸篓

source: Move Model to Trash?
zh_hans: 将模型移到废纸篓？

source: Move this GGUF file to the system Trash.
zh_hans: 将此 GGUF 文件移到系统废纸篓。

source: Move to Trash
zh_hans: 移到废纸篓

source: Multi-model Router
zh_hans: 多模型路由

source: Multi-model llama.cpp router control
zh_hans: 多模型 llama.cpp 路由控制

source: Names and File
zh_hans: 名称与文件

source: Native macOS interface
zh_hans: 原生 macOS 界面

source: Native multi-model control for llama.cpp on macOS
zh_hans: macOS 上原生的 llama.cpp 多模型控制工具

source: Navigate
zh_hans: 导航

source: Network
zh_hans: 网络

source: New
zh_hans: 新建

source: New configurations use a memory-safe 32K context by default.
zh_hans: 新配置默认使用更节省内存的 32K 上下文。

source: No Benchmark Results
zh_hans: 暂无测试结果

source: No Configured Models
zh_hans: 暂无已配置模型

source: No Downloads
zh_hans: 暂无下载

source: No Launch Profile
zh_hans: 暂无启动配置

source: No Local Models
zh_hans: 没有本地模型

source: No Main GGUF Artifacts
zh_hans: 没有主 GGUF 制品

source: No Matching Logs
zh_hans: 没有匹配的日志

source: No Model Settings
zh_hans: 暂无模型设置

source: No SHA-256 digest declared by the Hub.
zh_hans: Hub 未声明 SHA-256 摘要。

source: No Server Logs
zh_hans: 没有服务器日志

source: No Validated Runtimes
zh_hans: 没有已验证的运行时

source: No changelog was provided for this release.
zh_hans: 此版本未提供更新日志。

source: No downloads
zh_hans: 暂无下载

source: No local models
zh_hans: 没有本地模型

source: No managed runtime installed
zh_hans: 没有已安装的托管运行时

source: No owned server can be stopped.
zh_hans: 没有可停止的受管服务器。

source: No recent server activity.
zh_hans: 最近没有服务器活动。

source: No saved profiles reference this file.
zh_hans: 没有已保存的配置引用此文件。

source: No validated local models
zh_hans: 没有已验证的本地模型

source: Not configured
zh_hans: 未配置

source: Not declared
zh_hans: 未声明

source: Number of model layers offloaded to the GPU. Leave empty unless you need manual control.
zh_hans: 卸载到 GPU 的模型层数；除非需要手动控制，否则请留空。

source: OK
zh_hans: 好

source: OUT
zh_hans: 输出

source: Off
zh_hans: 关闭

source: Official Installer
zh_hans: 官方安装器

source: On
zh_hans: 开启

source: On Demand
zh_hans: 按需加载

source: One endpoint shared by every configured model.
zh_hans: 所有已配置模型共用一个服务端点。

source: One or more enabled model files no longer exist.
zh_hans: 一个或多个已启用的模型文件已不存在。

source: Open Dashboard
zh_hans: 打开 Dashboard

source: Open Download Queue
zh_hans: 打开下载队列

source: Open GGUF
zh_hans: 打开 GGUF

source: Open GGUF Model…
zh_hans: 打开 GGUF 模型…

source: Open GGUF…
zh_hans: 打开 GGUF…

source: Open Model Settings
zh_hans: 打开模型设置

source: Open Models
zh_hans: 打开模型

source: Open Runtime
zh_hans: 打开运行时

source: Open Runtimes
zh_hans: 打开运行时

source: Open Servers
zh_hans: 打开服务器

source: Open Service
zh_hans: 打开服务

source: Open Settings
zh_hans: 打开设置

source: Open WebUI
zh_hans: 打开 WebUI

source: Open a GGUF Model
zh_hans: 打开 GGUF 模型

source: Open on %@
zh_hans: 在 %@ 中打开

source: Open on Hugging Face
zh_hans: 在 Hugging Face 上打开

source: Open the built-in llama-server WebUI.
zh_hans: 打开 llama-server 内置 WebUI。

source: Optional Companions
zh_hans: 可选配套文件

source: Optional smaller model used for speculative decoding.
zh_hans: 用于推测解码的可选小型模型。

source: Output
zh_hans: 输出

source: Overview
zh_hans: 概览

source: Owned server status
zh_hans: 受管服务器状态

source: Owned server status: %@
zh_hans: 受管服务器状态：%@

source: Parallel Slots
zh_hans: 并行槽位

source: Parameters
zh_hans: 参数量

source: Pause
zh_hans: 暂停

source: Paused
zh_hans: 已暂停

source: Performance
zh_hans: 性能

source: Performance Summary
zh_hans: 性能摘要

source: Performance Tuning
zh_hans: 性能调优

source: Permanently delete this inactive managed runtime.
zh_hans: 永久删除此未激活的托管运行时。

source: Physical batch used per compute step.
zh_hans: 每个计算步骤使用的物理批大小。

source: Port
zh_hans: 端口

source: Port %@:%@ is already in use. Choose another port or stop the process using it.
zh_hans: 端口 %1$@:%2$@ 已被占用。请选择其他端口，或停止正在使用该端口的进程。

source: Portable model file format
zh_hans: 可移植模型文件格式

source: Present
zh_hans: 存在

source: Previous
zh_hans: 上一个

source: Probability-mass sampling cutoff.
zh_hans: 按累计概率质量截断采样。

source: Product
zh_hans: 产品

source: Profile
zh_hans: 配置

source: Profile Detail
zh_hans: 配置详情

source: Profile Name
zh_hans: 配置名称

source: Profile detail level
zh_hans: 配置详情级别

source: Profile, endpoint, launch command, and lifecycle
zh_hans: 配置、端点、启动命令和生命周期

source: Profiles
zh_hans: 配置

source: Project
zh_hans: 项目

source: Project, version, license, and runtime information.
zh_hans: 项目、版本、许可证与运行环境信息。

source: Prompt
zh_hans: 提示词

source: Prompt TPS
zh_hans: 提示词 TPS

source: Prompt and generation rates come from llama-server timings; batch output is measured across wall-clock time.
zh_hans: 提示词与生成速率来自 llama-server timings；批量输出速率按实际经过时间计算。

source: Public
zh_hans: 公开

source: Public repository
zh_hans: 公开仓库

source: Published
zh_hans: 发布时间

source: Quantization
zh_hans: 量化

source: Queue
zh_hans: 队列

source: Queued
zh_hans: 排队中

source: Quit LlamaDock
zh_hans: 退出 LlamaDock

source: Reading repository file tree…
zh_hans: 正在读取仓库文件树…

source: Ready
zh_hans: 就绪

source: Ready to install
zh_hans: 可以安装

source: Recent Activity
zh_hans: 最近活动

source: Redacted Diagnostics
zh_hans: 已脱敏诊断

source: Refresh
zh_hans: 刷新

source: Registering the managed runtime…
zh_hans: 正在注册托管运行时…

source: Release details unavailable
zh_hans: 发布详情不可用

source: Releases
zh_hans: 发行版本

source: Remove Token
zh_hans: 移除令牌

source: Remove from Library
zh_hans: 从模型库移除

source: Repeat Penalty
zh_hans: 重复惩罚

source: Replace Token
zh_hans: 替换令牌

source: Report an Issue
zh_hans: 报告问题

source: Requested output tokens per request.
zh_hans: 每个请求预期生成的输出 token 数。

source: Requests are routed by the API model identifier. Enabled models are written as separate sections in models.ini.
zh_hans: 请求按 API 模型标识路由；已启用模型会分别写入 models.ini 的独立节。

source: Requests are routed by the model identifier.
zh_hans: 请求按照模型标识符进行路由。

source: Requests processed concurrently.
zh_hans: 可并发处理的请求数。

source: Resident Memory
zh_hans: 常驻内存

source: Resolving
zh_hans: 正在解析

source: Resources
zh_hans: 资源

source: Restart
zh_hans: 重新启动

source: Restart Server
zh_hans: 重新启动服务器

source: Restart the owned llama-server process.
zh_hans: 重新启动受管 llama-server 进程。

source: Restore Safe Defaults
zh_hans: 恢复安全默认值

source: Restricted
zh_hans: 受限

source: Restricted repository
zh_hans: 受限仓库

source: Resume
zh_hans: 继续

source: Retry
zh_hans: 重试

source: Reveal in Finder
zh_hans: 在访达中显示

source: Review Profile
zh_hans: 检查配置

source: Review the generated command, then start the owned llama-server process.
zh_hans: 检查生成的命令，然后启动受管 llama-server 进程。

source: Revision: %@
zh_hans: 修订：%@

source: Role
zh_hans: 角色

source: Roll Back
zh_hans: 回滚

source: Router
zh_hans: 路由

source: Router State
zh_hans: 路由状态

source: Run
zh_hans: 运行

source: Run Benchmark
zh_hans: 运行性能测试

source: Running throughput sweep…
zh_hans: 正在执行吞吐量测试…

source: Runtime
zh_hans: 运行时

source: Runtime and model are ready. Start the server when you are ready.
zh_hans: 运行时和模型已就绪，可以启动服务器。

source: Runtime and model config are ready. Start the multi-model router when needed.
zh_hans: 运行时和模型配置已就绪，可按需启动多模型路由。

source: Runtime and profile are ready to start.
zh_hans: 运行时和配置已就绪，可以启动。

source: Runtime and profile are ready. Start the owned server when needed.
zh_hans: 运行时和配置已就绪，可按需启动受管服务器。

source: Runtime capability detection is unavailable or inconclusive.
zh_hans: 无法检测运行时功能，或检测结果不确定。

source: Runtime default
zh_hans: 运行时默认值

source: Runtime not configured
zh_hans: 未配置运行时

source: Runtime operation in progress
zh_hans: 正在执行运行时操作

source: Runtime updates are independent from LlamaDock app updates.
zh_hans: 运行时更新与 LlamaDock 应用更新相互独立。

source: Runtimes
zh_hans: 运行时

source: SPLIT
zh_hans: 分片

source: Safely extracting the archive…
zh_hans: 正在安全解压归档…

source: Sampling
zh_hans: 采样

source: Sampling Defaults
zh_hans: 采样默认值

source: Save Token
zh_hans: 保存令牌

source: Saved automatically
zh_hans: 已自动保存

# Scanned %lld %@
source: Scanned %1$lld %2$@
zh_hans: 已扫描 %1$lld 个%2$@

source: Scanned %lld model folders
zh_hans: 已扫描 %lld 个模型文件夹

source: Scanning GGUF metadata…
zh_hans: 正在扫描 GGUF 元数据…

source: Search
zh_hans: 搜索

source: Search configured models
zh_hans: 搜索已配置模型

source: Search local models
zh_hans: 搜索本地模型

source: Search public GGUF repositories on ModelScope or paste a modelscope.cn repository URL.
zh_hans: 搜索 ModelScope 上的公开 GGUF 仓库，或粘贴 modelscope.cn 仓库 URL。

source: Search the Hugging Face Hub or paste the same repository reference accepted by llama.cpp's -hf option.
zh_hans: 搜索 Hugging Face Hub，或粘贴 llama.cpp 的 -hf 选项所接受的同类仓库引用。

source: Searching %@
zh_hans: 正在搜索 %@

source: Searching Hugging Face
zh_hans: 正在搜索 Hugging Face

source: Seconds allowed for a clean model unload.
zh_hans: 允许模型正常卸载的秒数。

source: Seed
zh_hans: 随机种子

source: Select a GGUF file to inspect its metadata and current router state.
zh_hans: 选择一个 GGUF 文件以查看元数据和当前路由状态。

source: Select a GGUF file to inspect metadata and create a profile.
zh_hans: 选择 GGUF 文件以查看元数据并创建配置。

source: Select a destination from the sidebar.
zh_hans: 从边栏中选择目标。

source: Select a model on the left to review its availability, API name, and performance settings.
zh_hans: 选择左侧模型以查看其可用方式、API 名称和性能设置。

source: Select a repository to inspect its GGUF files.
zh_hans: 选择仓库以查看其中的 GGUF 文件。

source: Selected Artifact Manifest
zh_hans: 所选制品清单

source: Server
zh_hans: 服务器

source: Server Logs
zh_hans: 服务器日志

source: Server defaults and individual model behavior
zh_hans: 服务器默认设置与各模型行为

source: Server log
zh_hans: 服务器日志

source: Server operation in progress
zh_hans: 正在执行服务器操作

source: Server performance
zh_hans: 服务器性能

source: Servers
zh_hans: 服务器

source: Service
zh_hans: 服务

source: Service Lifecycle
zh_hans: 服务生命周期

source: Set availability, names, context size, and GPU offload.
zh_hans: 设置可用方式、名称、上下文大小和 GPU 卸载。

source: Set server-side generation defaults only when API clients do not provide their own values.
zh_hans: 仅在 API 客户端未提供值时设置服务器端生成默认值。

source: Settings
zh_hans: 设置

source: Settings Area
zh_hans: 设置区域

source: Settings…
zh_hans: 设置…

source: Setup and usage guide
zh_hans: 安装与使用指南

source: Severity
zh_hans: 严重级别

# Shard %llu of %llu
source: Shard %1$llu of %2$llu
zh_hans: 第 %1$llu / %2$llu 个分片

source: Show LlamaDock
zh_hans: 显示 LlamaDock

source: Show application icon in Dock
zh_hans: 在程序坞中显示应用图标

source: Show in Finder
zh_hans: 在访达中显示

source: Show menu bar icon
zh_hans: 显示菜单栏图标

source: Shown only in LlamaDock. Rename it to distinguish configurations for the same model.
zh_hans: 仅显示在 LlamaDock 中。可重命名以区分同一模型的不同配置。

source: Simplified Chinese
zh_hans: 简体中文

source: Single
zh_hans: 单请求

source: Sleeping
zh_hans: 休眠

source: Source code and project
zh_hans: 源代码与项目主页

source: Source: %@
zh_hans: 来源：%@

source: Split
zh_hans: 分片

source: Start
zh_hans: 启动

source: Start Server
zh_hans: 启动服务器

source: Start the LlamaDock server, choose a model and workload, then run a local throughput sweep.
zh_hans: 启动 LlamaDock 服务，选择模型和工作负载，然后运行本地吞吐量测试。

source: Start the configured multi-model router.
zh_hans: 启动已配置的多模型路由服务。

source: Start the multi-model server before running a benchmark.
zh_hans: 请先启动多模型服务，再运行性能测试。

source: Start the selected launch profile.
zh_hans: 启动所选配置。

source: Starting
zh_hans: 正在启动

source: Status
zh_hans: 状态

source: Status is reported by the running llama-server /models endpoint.
zh_hans: 状态由运行中的 llama-server /models 端点返回。

source: Stop
zh_hans: 停止

source: Stop Server
zh_hans: 停止服务器

source: Stop the LlamaDock server before installing and activating a managed runtime.
zh_hans: 安装并激活托管运行时前，请先停止 LlamaDock 服务器。

source: Stop the LlamaDock server before rolling back runtimes.
zh_hans: 回滚运行时前，请先停止 LlamaDock 服务器。

source: Stop the LlamaDock server before switching runtimes.
zh_hans: 切换运行时前，请先停止 LlamaDock 服务器。

source: Stop the owned llama-server process.
zh_hans: 停止受管 llama-server 进程。

source: Stop the server before deleting a model setting used by its generated config.
zh_hans: 删除生成配置中使用的模型设置前，请先停止服务器。

source: Stop the server before deleting its profile.
zh_hans: 删除配置前，请先停止服务器。

source: Stopped
zh_hans: 已停止

source: Stopping
zh_hans: 正在停止

source: Stopping the owned llama-server process.
zh_hans: 正在停止受管 llama-server 进程。

source: Stored as a generic password in macOS Keychain. The value is never written to settings, UserDefaults, or logs.
zh_hans: 令牌以通用密码形式存储在 macOS 钥匙串中，绝不会写入设置、UserDefaults 或日志。

source: Supported
zh_hans: 支持

source: Synthetic prompts stay on this Mac. Larger contexts and higher concurrency can consume substantial memory.
zh_hans: 合成提示词仅在本机处理。更大的上下文与更高并发可能消耗大量内存。

source: System
zh_hans: 系统

source: System Prompt
zh_hans: 系统提示词

source: Technical preview of the configuration LlamaDock will use.
zh_hans: LlamaDock 将使用的配置技术预览。

source: Temperature
zh_hans: 温度

source: Tensors
zh_hans: 张量数

source: The API and built-in WebUI are reachable.
zh_hans: API 和内置 WebUI 可以访问。

source: The GGUF file used by this configuration.
zh_hans: 此配置使用的 GGUF 文件。

source: The MIT License permits use, copying, modification, distribution, and private or commercial use subject to its copyright and license notice.
zh_hans: MIT 许可证允许使用、复制、修改与分发，包括私人或商业用途，但须保留版权与许可证声明。

source: The WebUI is available when the service is ready.
zh_hans: 服务就绪后即可使用 WebUI。

source: The active runtime cannot be deleted.
zh_hans: 不能删除当前激活的运行时。

source: The imported artifact directory is incomplete. LlamaDock will not overwrite it.
zh_hans: 已导入的产物目录不完整。LlamaDock 不会覆盖它。

source: The last start failed: %@
zh_hans: 上次启动失败：%@

source: The local API and WebUI are ready.
zh_hans: 本地 API 和 WebUI 已就绪。

source: The multi-model API and built-in WebUI are reachable.
zh_hans: 多模型 API 与内置 WebUI 均可访问。

source: The previous runtime is retained for one-click rollback.
zh_hans: 上一个运行时会保留以支持一键回滚。

source: The repository file tree did not contain a safe main .gguf artifact.
zh_hans: 仓库文件树中没有安全的主 .gguf 制品。

source: The selected GGUF model no longer exists.
zh_hans: 所选 GGUF 模型已不存在。

source: The selected llama-server must support multi-model presets.
zh_hans: 所选 llama-server 必须支持多模型预设。

source: The selected managed runtime is no longer installed.
zh_hans: 所选托管运行时已不再安装。

source: The selected model is no longer in the library.
zh_hans: 所选模型已不在模型库中。

source: The selected runtime advertises this flag.
zh_hans: 所选运行时声明支持此参数。

source: The selected runtime does not support: %@. Remove those values or choose another runtime.
zh_hans: 所选运行时不支持：%@。请移除这些值或选择其他运行时。

source: The selected runtime help does not advertise this flag.
zh_hans: 所选运行时的帮助信息未声明支持此参数。

source: The server is already running.
zh_hans: 服务器已在运行。

source: The server is not ready to restart.
zh_hans: 服务器尚不能重新启动。

source: The service failed: %@
zh_hans: 服务失败：%@

source: These controls are useful for benchmarking or solving memory and throughput issues.
zh_hans: 这些控件适合用于性能测试，或排查内存与吞吐量问题。

source: These settings apply to every model profile.
zh_hans: 这些设置适用于所有模型配置。

source: This GGUF file is invalid and cannot be used to create a launch profile.
zh_hans: 此 GGUF 文件无效，无法用于创建启动配置。

source: This creates a profile for one file. Add its folder separately if you want it restored in the model library.
zh_hans: 这会为单个文件创建配置。如果希望它在模型库中恢复，请另外添加其所在文件夹。

source: This model is not included in the generated llama-server config.
zh_hans: 此模型未包含在生成的 llama-server 配置中。

source: This permanently deletes unfinished files for %@ and removes the task from the download queue. This cannot be undone.
zh_hans: 此操作将永久删除 %@ 的未完成文件，并从下载队列中移除该任务。此操作无法撤销。

source: This permanently removes %@ from LlamaDock's managed runtime directory. The active and previous runtimes are always retained for service continuity and rollback.
zh_hans: 这会从 LlamaDock 的托管运行时目录中永久移除 %@。当前和上一个运行时始终会保留，以确保服务连续性和支持回滚。

source: This removes only the saved configuration for %@. The GGUF model file is not deleted.
zh_hans: 这只会移除 %@ 的已保存配置，不会删除 GGUF 模型文件。

source: This repository requires a Hugging Face token with access. Add one in Settings; LlamaDock has not sent any credentials.
zh_hans: 此仓库需要具备访问权限的 Hugging Face 令牌。请在设置中添加；LlamaDock 尚未发送任何凭据。

source: This runtime's help output could not be recognized. Typed settings are marked Unknown and will still be passed through.
zh_hans: 无法识别此运行时的帮助输出。类型化设置会标记为未知，但仍会原样传递。

source: This split companion is incomplete and cannot be selected.
zh_hans: 此分片配套文件不完整，无法选择。

source: Threads
zh_hans: 线程

source: Throughput Benchmark
zh_hans: 吞吐量测试

source: Tokens
zh_hans: Token 数

source: Total download progress
zh_hans: 总下载进度

source: Trial Results
zh_hans: 测试结果

source: Try a Small Test Repository
zh_hans: 试用小型测试仓库

source: Unknown
zh_hans: 未知

source: Unload Stop Timeout
zh_hans: 停止卸载超时

source: Unsupported
zh_hans: 不支持

source: Updates
zh_hans: 更新

source: Uptime
zh_hans: 运行时间

source: Use Runtime Defaults
zh_hans: 使用运行时默认值

source: Use a fixed value for repeatable output.
zh_hans: 使用固定值以获得可重复的输出。

source: Use a friendly name in LlamaDock and a stable identifier in API requests.
zh_hans: 在 LlamaDock 中使用易懂的名称，并为 API 请求设置稳定标识。

source: Use the runtime default unless testing requires a fixed value.
zh_hans: 除非测试需要固定值，否则使用运行时默认值。

source: Valid
zh_hans: 有效

source: Valid range: 1–65535.
zh_hans: 有效范围：1–65535。

source: Validating architecture and binaries…
zh_hans: 正在验证架构和二进制文件…

source: Validation
zh_hans: 验证

source: Value cache data type.
zh_hans: Value 缓存的数据类型。

source: Verifying
zh_hans: 正在验证

source: Verifying archive size and checksum…
zh_hans: 正在验证归档大小和校验和…

source: Version
zh_hans: 版本

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@（%2$@）

source: Version history and downloads
zh_hans: 版本历史与下载

source: View All Logs
zh_hans: 查看全部日志

source: View License
zh_hans: 查看许可证

source: View Logs
zh_hans: 查看日志

source: View on GitHub
zh_hans: 在 GitHub 上查看

source: Vision Projector
zh_hans: 视觉投影器

source: WARN
zh_hans: 警告

source: Wait for the current model operation to finish.
zh_hans: 请等待当前模型操作完成。

source: Wait for the current model or runtime operation to finish before restarting the server.
zh_hans: 重新启动服务器前，请等待当前模型或运行时操作完成。

source: Wait for the current runtime operation to finish.
zh_hans: 请等待当前运行时操作完成。

source: Wait for the current server operation to finish.
zh_hans: 请等待当前服务器操作完成。

source: Wait for the managed runtime operation to finish before starting a server.
zh_hans: 启动服务器前，请等待托管运行时操作完成。

source: Wait for the model Trash operation to finish before starting a server.
zh_hans: 启动服务器前，请等待模型移到废纸篓的操作完成。

source: Waiting for llama-server health readiness.
zh_hans: 正在等待 llama-server 健康检查就绪。

source: Waiting for the health endpoint to become ready.
zh_hans: 正在等待健康检查端点就绪。

source: Wall Time
zh_hans: 实际耗时

source: Warming up model…
zh_hans: 正在预热模型…

source: Warnings & Errors
zh_hans: 警告与错误

source: Where llama-server accepts connections.
zh_hans: llama-server 接受连接的地址。

source: from GitHub
zh_hans: 来自 GitHub

source: llama-server executable missing
zh_hans: 缺少 llama-server 可执行文件

source: llama.cpp Runtime
zh_hans: llama.cpp 运行时

source: Global Model Defaults
zh_hans: 全局模型默认设置

source: Shared by every model unless its model settings provide an override.
zh_hans: 所有模型共享；单个模型设置中的覆盖项优先。

source: Maximum shared KV context per loaded model. Range: 1K–1M tokens.
zh_hans: 每个已加载模型的最大共享 KV 上下文。范围：1K–1M token。

source: K Cache Type
zh_hans: K 缓存类型

source: Key-cache precision. Lower-bit types save memory at some quality cost.
zh_hans: 键缓存精度。更低位宽可节省内存，但可能影响质量。

source: V Cache Type
zh_hans: V 缓存类型

source: Value-cache precision. q8_0 is the memory-safe default.
zh_hans: 值缓存精度。q8_0 是更节省内存的默认值。

source: Let llama.cpp choose, offload all layers, or keep model layers on CPU.
zh_hans: 让 llama.cpp 自动选择、卸载全部层，或将模型层保留在 CPU。

source: KV Cache Offload
zh_hans: KV 缓存卸载

source: Keep KV cache compute on the GPU when supported.
zh_hans: 在支持时将 KV 缓存计算保留在 GPU。

source: Enable KV cache offload
zh_hans: 启用 KV 缓存卸载

source: Fit to Available Memory
zh_hans: 适配可用内存

source: Allow llama.cpp to tune automatic options to preserve a free-memory margin.
zh_hans: 允许 llama.cpp 调整自动参数，以保留空闲内存余量。

source: Enable memory fitting
zh_hans: 启用内存适配

source: Free-memory Target
zh_hans: 空闲内存目标

source: Memory margin llama.cpp tries to leave available on each device.
zh_hans: llama.cpp 尝试在每个设备上保留的内存余量。

source: Minimum Fit Context
zh_hans: 内存适配最小上下文

source: Lowest context llama.cpp may choose while fitting memory.
zh_hans: llama.cpp 适配内存时可选择的最低上下文。

source: Global Performance Defaults
zh_hans: 全局性能默认设置

source: Common llama.cpp scheduling and prompt-processing settings.
zh_hans: 通用的 llama.cpp 调度与提示词处理设置。

source: Automatic is recommended; force a mode only for compatibility testing.
zh_hans: 建议使用自动模式；仅在兼容性测试时强制指定。

source: CPU Threads
zh_hans: CPU 线程

source: Generation worker threads. Automatic uses the runtime default.
zh_hans: 生成工作线程数。自动模式使用运行时默认值。

source: Automatic
zh_hans: 自动

source: Concurrent inference slots sharing the configured context cache.
zh_hans: 共享已配置上下文缓存的并发推理槽位数。

source: Logical maximum tokens processed in one prompt batch.
zh_hans: 单个提示词批次处理的逻辑最大 token 数。

source: Physical compute batch; it cannot exceed the logical batch size.
zh_hans: 物理计算批次，不能超过逻辑批处理大小。

source: All layers
zh_hans: 全部层

source: CPU only
zh_hans: 仅 CPU

source: Global default
zh_hans: 全局默认值

source: Leave fields empty to inherit the global model defaults.
zh_hans: 留空即可继承全局模型默认设置。

source: Use Global Defaults
zh_hans: 使用全局默认值

source: Optional per-model overrides for the global performance defaults.
zh_hans: 用于覆盖全局性能默认值的可选单模型设置。

source: Inherit the global mode unless this model needs a compatibility override.
zh_hans: 除非此模型需要兼容性覆盖，否则继承全局模式。

source: Optional key-cache precision override.
zh_hans: 可选的键缓存精度覆盖。

source: Optional value-cache precision override.
zh_hans: 可选的值缓存精度覆盖。

source: offline cache
zh_hans: 离线缓存

source: seconds
zh_hans: 秒

source: stdout and stderr from the owned llama-server process will appear here.
zh_hans: 受管 llama-server 进程的标准输出和标准错误会显示在这里。

source: tokens
zh_hans: token

source: validated cache
zh_hans: 已验证缓存
